[
{
"title":"Demon Horde Master",
"platforms":[
"PC (Microsoft Windows)"],
"game_description":"In Demon Horde Master you fight your opponent in a 1-on-1 chess like strategy card game with your own army of demons through which you cast your powerful magic and defeat your opponent to become the new leader of hell! For this you have 45 different spells, and 20 demons available.",
"release_date":"Jul 24, 2015",
"cover":""
},
{
"title":"Gemstone IV",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser"],
"game_description":"Gemstone IV is a text-based online roleplaying game developed by Simutronics and launched in November 2003. It is the fourth iteration of the on-going Gemstone series.",
"release_date":"1998",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/ns5med7gdz6hct5nzouy.jpg"
},
{
"title":"Choo-Choo! Train Rides!",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Web browser"],
"game_description":"Understand that your old world is no longer exists. You have only a locomotive, a pair of companions and tail of mutated wild animals that are hungry as never before. There are only a couple of ways to survive. Which one is better - it's up to you.",
"release_date":"Aug 10, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3n3f.jpg"
},
{
"title":"City Mysteries",
"platforms":[
"Nintendo 3DS",
"PC (Microsoft Windows)",
"Mac",
"Web browser"],
"game_description":"Search buildings, streets, landmarks as you seek and find hidden objects in New York, Paris, Moscow and London!",
"release_date":"Jul 03, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/yektasaxw6l4ejte7ljb.jpg"
},
{
"title":"Apollo LM",
"platforms":[
"iOS",
"PC (Microsoft Windows)",
"Mac",
"Web browser"],
"game_description":"3D fly and land the Apollo Lunar Module on the moon! Easy and precise control with one finger. Real moon topology mapping. Rewrite humanity's greatest achievement and... Land the 1st woman on the moon! Place your country's flag on the moon! Apollo mission dialogue voices transcription. Be Miss or Mr Armstrong. Evolve your Astronaut level. Evolve the Lunar Module. Challenge your astronaut friends through the Game Center.",
"release_date":"Sep 24, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/yektasaxw6l4ejte7ljb.jpg"
},
{
"title":"Black Jack Story",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser"],
"game_description":"In the game, you act as a participant in a large card tournament 'Golden Skull', held among the best players from all over the world.",
"release_date":"Apr 25, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/yektasaxw6l4ejte7ljb.jpg"
},
{
"title":"Panic Porcupine",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Web browser"],
"game_description":"Dr. Proventriculus is snatching up the Chickabirbs! Help Panic blast through over 50 stages of topsy-turvy, spike-laced, slime-drenched, buzzsaw-filled deathtraps to rescue them! And remember, there are no rings...",
"release_date":"Oct 27, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5r52.jpg"
},
{
"title":"Knightmare",
"platforms":[
"Wii",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Knightmare, known in Japan as Majou Densetsu (魔城伝説 , Demon Castle Legend?), is a 1986 MSX vertical scrolling shooter computer game. The player is a knight, Popolon, who has to fight his way through several levels to defeat Hudnos and rescue Aphrodite.Knightmare was an innovative upward-scrolling shoot 'em up game on the MSX system released as game cartridge. The top-view graphics were considered very sophisticated for its time, similar to other MSX games such as Nemesis and Penguin Adventure.Konami also released a slightly altered version that could be bought from LINKS network. (Japanese 'internet replacement' of the 80's) In this version you could submit high scores to online server.It was brought without a license to the SG-1000 in Taiwan.",
"release_date":"Jan 08, 2003",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5xml.jpg"
},
{
"title":"With Loneliness",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"'With Loneliness' is an athletic VR game that aims to escape from 'garbage world' by clearing obstacles.",
"release_date":"Apr 29, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5xml.jpg"
},
{
"title":"Falsion",
"platforms":[
"Family Computer Disk System",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"A Konami shoot-em-up depicted from behind the ship on a Z axis, similar to After Burner or Space Harrier, for the Famicom Disk System. It has the distinction of being one of the few games that worked with the Famicom 3D imaging system.",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/d2ybe5f8fje4gyim0ea1.jpg"
},
{
"title":"Family Trainer: Extreme Challenge",
"platforms":[
"Wii",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Family Trainer: Extreme Challenge is the follow up to the successful Family Trainer game/mat bundle.",
"release_date":"Sep 25, 2009",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/d2ybe5f8fje4gyim0ea1.jpg"
},
{
"title":"Xbox Live Arcade Compilation Disc",
"platforms":[
"Xbox 360",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Xbox Live Arcade Compilation Disc is a package of five Xbox Live Arcade games. The compilation was packaged with the Xbox 360 Arcade. The disc works by inserting it into the system just like any other game. However, rather than directly launching any of the titles, it adds five items to the Xbox Live Arcade menu with a small disc icon next to each name.It's also included demos for:-Marble Blast Ultra-3D Ultra Minigolf Adventures-Frogger-Viva Pinata-Surf's Up-Zuma-Soltrio Solitaire",
"release_date":"Oct 23, 2007",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/zbl5jzkdqlxl5jmc82ve.jpg"
},
{
"title":"Rambo",
"platforms":[
"Arcade",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Rambo is a light gun shooter developed by Sega for the arcades in 2008. Based on the films Rambo: First Blood Part II (1985) and Rambo III (1988).",
"release_date":"Sep 18, 2008",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2aez.jpg"
},
{
"title":"Drone Fighters",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Arcade style drone fights in VR! Customize your fighter, arm your battle hungry drones with awesome weapons and dominate your opponents in epic cage fights set in futuristic arenas.",
"release_date":"Apr 21, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2ayx.jpg"
},
{
"title":"Castle Battles",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"DOS",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Castle Battles streamlines the mechanics of classic, top-down strategy to create a fast paced style of gameplay like no other. Expand your empire by building castles near bountiful resources, collect gold to amass outlandish armies, and swarm your enemies in 40 unique levels.",
"release_date":"Dec 16, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3mwz.jpg"
},
{
"title":"Constant C",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"MSX",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Constant C is a 2D puzzle platformer with two core gameplay mechanics - Gravity Shifting and the Time Field. Using these two mechanics in the game, the player controls the momentum of various objects to complete each level. Dive into the world of Constant C, where rules of fundamental physics no longer apply. In a space station far away from Earth, mysterious events have triggered the distortion of time. Journey through the game as a lone robot, who uncovers the truth behind the incident step by step, and finds the purpose of his own creation.",
"release_date":"Feb 02, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/s7ppd5hrtqszzgibhc2u.jpg"
},
{
"title":"Discworld MUD",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Discworld MUD is an online, text based multiplayer game, set in Terry Pratchett's Discworld.",
"release_date":"May 09, 1992",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/fx7blsq4bfv933y1phfw.jpg"
},
{
"title":"Boinks",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Populate the screen with the happy Boinks. Avoid the nasty bouncies. Fill enough of the screen to progress to the next level. Use your mouse to inflate the Boinks and remember to drop them before they are hit by any nasties, or you'll have to start again. Watch out for the timer and you have a limited number of Boinks per level so make the most of them.",
"release_date":"Nov 27, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co29z2.jpg"
},
{
"title":"Seance: The Unquiet",
"platforms":[
"Oculus VR",
"SteamVR",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Get a sneak preview of Séance: The Unquiet, an immersive VR ghost story coming in 2017.",
"release_date":"May 02, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co272s.jpg"
},
{
"title":"10tons Adventure Puzzles Bundle",
"platforms":[
"Xbox One",
"SteamVR",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Sparkle 2: Sparkle 2 is a superbly polished marble shooter action puzzle game with beautiful graphics, mighty powerups and an amazing soundtrack. Match the orbs before they fall into the abyss and find your way through mysterious lands of startling beauty!Azkend 2: Step aboard a fantastic adventure! Enjoy amazing match-three gameplay and discover one of the most astonishing worlds ever imagined.",
"release_date":"Nov 25, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/kqqk9h3gwdb1hmsnfonn.jpg"
},
{
"title":"Demon's Rise - Lords of Chaos",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo Switch",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Demon’s Rise: Lords of Chaos is a turn-based, tactical RPG set in a brutal and unforgiving fantasy world. Taking place amidst a horrific war in the cold north, the campaign will see your party fight innumerable enemies, huge monsters and powerful sorcerers. Victory will require the tactical use of terrain, morale, formations and magic. Build an increasingly powerful war band, command demonic allies, and crush those that stand against you.",
"release_date":"Apr 24, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co387s.jpg"
},
{
"title":"Asonde Shogi ga Tsuyoku Naru! Ginsei Shogi DX2",
"platforms":[
"Nintendo Switch",
"Nintendo Switch",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Shogi software with functions that even beginners can enjoy. Have fun learning and become stronger!",
"release_date":"Feb 24, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4h1b.jpg"
},
{
"title":"Project Skylab",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo Switch",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Project Skylab is an educational Algebra Sci-fi FPS that takes place on the surface of Mars.",
"release_date":"Aug 16, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4h1b.jpg"
},
{
"title":"Techtonica",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo Switch",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Techtonica is a first-person factory building game set beneath the surface of an alien planet. Work alone or in co-op to build factories, gather resources, research new technologies, mold the destructible terrain, establish a base of operations, and uncover long-forgotten secrets.",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4kjg.jpg"
},
{
"title":"The Inlaws",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo Switch",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"The Inlaws is a comedy adventure game that is designed with elements from sitcoms such as audience laughter. The game consists of a single episode and the player takes control of a middle aged man called Ed who, along with his family, visits his in-laws to celebrate the tenth birthday of the son in the family. Ed is a mischievous being, though, who can't resist making the life of his poor brother-in-law as miserable as possible. There are thus two objectives: mess with the son's birthday gifts and ruin the performance of the hired entertainment troupe.The player controls Ed from a third-person perspective and can explore a three dimensional environment that consists of the inlaws' house as well as their back garden. The gameplay is typical for an adventure game as Ed collects items that are stored in his inventory where they can be combined with others to create new ones. By using the items on certain objects in environment or on a character, cut-scenes are triggered that advance the story. Some characters can be talked to and the player then has to choose the dialogue option that will please the character. For each puzzle solved the player earns points. When stuck it is possible to use a help option which shows the direction to the object or character that the player needs to interact with next. When using it the player will not earn any points though.",
"release_date":"Jan 21, 2010",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4ko3.jpg"
},
{
"title":"FIshing Adventure VR",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo Switch",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Fishing Adventure VR is a typical fishing game, where the player can (drums) catch different fish species! Fish in USA, Hawaii and other unique fisheries.",
"release_date":"Jan 07, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3zpy.jpg"
},
{
"title":"Hole.io",
"platforms":[
"Android",
"iOS",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Enter the arena and face the other holes in a fierce battle.Eat everything in sight with your black hole and expand it to eat more! Show them who is the biggest hole in town!",
"release_date":"May 25, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/usjlcfotn6pgbbf2k9ve.jpg"
},
{
"title":"Neon Arena",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Neon Arena is a space arcade scoring arena game.",
"release_date":"Sep 17, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5j6k.jpg"
},
{
"title":"Shudder",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Shudder is a high speed, twin-stick shooter with one stick and no shooting. Lost in an interdimensional wormhole, absorb powerful cosmic cells to charge up the awesome power of the SHUDDER Drive 9000TM and use it against the onslaught of interstellar Para-Bugs. Shatter Vortex-Cubes and decimate the bio-organic threat to rack up high scores and harvest rare resources to unlock more powerful ships and increase your chances of survival.",
"release_date":"Aug 30, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4132.jpg"
},
{
"title":"Botzin!!!",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"BOTZIN!!! is a free turn-based ballistic strategy game that aims to defeat other robots from different teams.",
"release_date":"Apr 30, 2004",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4axr.jpg"
},
{
"title":"Filcher",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Filcher is a first-person, 2.5D, mission-based stealth game. As Sporey the master thief, break into guarded buildings to steal from the wealthy and corrupt, using only your senses, your wits, and a handful of tools and gadgets.",
"release_date":"Sep 14, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co464i.jpg"
},
{
"title":"MXGP2: The Official Motocross Videogame Compact",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"MXGP2 - The Official Motocross Videogame Compact will let you relive the Motocross World Championship, allowing you to choose all the riders, official teams and tracks from the 2015 MXGP-class season!",
"release_date":"Jan 26, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co250i.jpg"
},
{
"title":"Rhom Bus",
"platforms":[
"iOS",
"PlayStation 4",
"DOS",
"Mac",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"New, addictive and clever game mechanics in a beautiful and carefully designed world of rhombuses. Turn the tiles or turn the board to complete the levels and help the animals getting on the bus.",
"release_date":"Feb 22, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co250i.jpg"
},
{
"title":"Historia Battles Crusade",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Historia-Battles is a 2D multiplatform turn-based strategy game reproducing real historical battles.  Inspired by classic chess game and traditional war board game, the main game design philosophy is player involvement in real historical context, fun and challenge, keeping low game complexity and time to learn.",
"release_date":"Jan 20, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co26lo.jpg"
},
{
"title":"Sherwood Classic",
"platforms":[
"Web browser",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Sherwood(now Sherwood Classic) was an old MMO by Maid Marian. In it users can fight against two mobs being Evil Minions and Giant Spiders. They may also fight amongst each other in PVP. New items were obtained via chests throughout the island which contained a single fortress.",
"release_date":"2004",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3c0y.jpg"
},
{
"title":"Gamma World: Alpha Mutation",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Based on the TSR world of the same name.Gamma Terra is made up of the debris of multiple fractured realities, all competing to occupy the same time-space. You’re a native of this altered world, and a lucky one: You have powers and abilities bequeathed upon you by mutations, reality transpositions, and adaptation to the world left over from the initial time-space disaster. These special gifts are described by your character origin. Each Gamma World character begins play with two character origins.A character origin is a mutation, a body form, or a talent tree.",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/tx3tsdpaenjuaaegnxaj.jpg"
},
{
"title":"The Citizen Part II",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Set in and around City 17, 'The Citizen Part Two' contains the next three chapters of our citizen's story. After the events of the previous two chapters, you find yourself rescued from the grave by rebels, among whom you are now a valuable asset. Taken to a makeshift field hospital, you recover in the hands of rebel medics. But the Combine are determined to crush the rebels out of existence, and the peace can't last long. You will face choices, and how you decide to proceed will ultimately dictate how the story plays out for you. Some choices are less obvious than others, and require you to take initiative where you otherwise might be distracted. One way or another, it's time to take back the city.",
"release_date":"Dec 25, 2010",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5lsi.jpg"
},
{
"title":"Fengse Huanxiang 4: Shengzhan de Zhongyan",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"**This game is playable in Chinese only**This installment of Fengse Huanxiang (Wind Fantasy) series is connected plot-wise to its predecessor, and is set in the same fantasy world and time line. The war between the countries of Ice and Fire devastated both those states, and Karin Seraphim, the white-haired leader of the special unit 'Sin-Breaking Wings', found herself and her best friend in the opposite camps. Now, with the rulers of both countries dead, the war is finally over. However, there is a new disturbance in the Dragon Tomb. The Holy City of Nilu sends the priestess Niyi to investigate the matter. And when the young woman arrives at the tomb, she finds demons there... is this the beginning of a new war?",
"release_date":"Nov 11, 2005",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5yfy.jpg"
},
{
"title":"Simple 1500 Series Vol. 7: The Card",
"platforms":[
"PlayStation",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Simple 1500 vol. 7: the Card is a card game compilation by Success.",
"release_date":"Nov 19, 1998",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/slia1tgtl2xaijswnghl.jpg"
},
{
"title":"Sherbet Thieves",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Sherbet Thieves is a 2D indie game that combines twin-stick shooting and defense mechanics.As jetpack mercenary Proton Joe, the goal is to prevent sherbet pirates, space hippies with the munchies, and other aliens from stealing sherbet from Farmer Dan’s orbital farm. The player is paid in moonshine depending on how well they did at protecting the sherbet. Between levels weapons and upgrades can be purchased with this moonshine.There are 3 difficulty levels, 19 story-mode levels, and a never-ending survival mode.",
"release_date":"Feb 12, 2013",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3h7m.jpg"
},
{
"title":"Forgotten Land",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Forgotten Land is a small adventure game in which you will play for the driver who had an accident. The protagonist finds himself in a large valley, which according to local legend was called the Forgotten Land.",
"release_date":"Oct 09, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2bfm.jpg"
},
{
"title":"Mortal Kombat: Unchained",
"platforms":[
"PlayStation Portable",
"PC (Microsoft Windows)",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Mortal Kombat: Unchained is the portable equivalent of the console game Mortal Kombat: Deception. It contains all the characters from the GameCube version, along with four exclusive to the PSP version: Blaze, Frost, Jax and Kitana. All characters have a vast arsenal of moves, with weapons, and fatalities. The arenas are multi-tiered, interactive and contain death traps. Next to the regular battles, you can play a free-roaming adventure in the Konquest Mode, battle an endless wave of opponents in the Endurance Mode (exclusive for the PSP), go head-to-head over Wi-Fi against another human player, or try a mini-game such as Chess Kombat (chess with the MK characters) and Puzzle Kombat (Tetris with a twist).",
"release_date":"Nov 13, 2006",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co20le.jpg"
},
{
"title":"Once More",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Rewrite the past to create the future you deserve.",
"release_date":"Oct 27, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3ql2.jpg"
},
{
"title":"Magenta Horizon",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Magenta Horizon is a fast-paced hack-and-slash 2D platformer where you play as Gretel, a reaper in this purgatory-like afterlife.",
"release_date":"Oct 17, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co40q9.jpg"
},
{
"title":"F-117 Night Storm",
"platforms":[
"Sega Mega Drive/Genesis",
"Mac",
"Mac",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"This game allows the player to take control of an F-117A Stealth Fighter. The game is broken down into either an arcade or campaign mode.In the arcade mode, the player can decide the number of enemy air and ground units, the environment, length of mission, and the difficulty level. This mode allows the player to hone their skills in order to prepare for the campaign mode.The campaign mode is the main part of the game and contains 30 missions. The game includes nine theaters of combat such as training missions in the Nevada Desert, to the conflict in Panama, and also to the Gulf War. Each mission has a primary object that must be destroyed in order to advance to the next mission.",
"release_date":"Feb 01, 1993",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5l8h.jpg"
},
{
"title":"Tom Clancy's Rainbow Six Siege: Operation Black Ice",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Xbox One",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Operation Black Ice is the first expansion released for Tom Clancy's Rainbow Six Siege. All content released is for free to players. It adds two new Operators from the Joint Task Force 2 CTU, featuring new weapons, abilities, and gameplay upgrades.",
"release_date":"Feb 09, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1z2e.jpg"
},
{
"title":"Sleep When I'm Dead",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Xbox One",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Sleep When I'm Dead is a survival horror twin stick shooter with a distinctive art style.",
"release_date":"Oct 31, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2kbv.jpg"
},
{
"title":"Dune!",
"platforms":[
"iOS",
"PlayStation 4",
"Xbox One",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"Jump above the line to score, but beware! The higher you get, the harder the landing will be! Don't crash and keep it smooth!",
"release_date":"Oct 11, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/qdhfpowmapgbxeshwvqh.jpg"
},
{
"title":"SingStar Guitar",
"platforms":[
"PlayStation 3",
"PlayStation 4",
"Xbox One",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"SingStar Guitar is a spin-off of the karaoke-only SingStar series. It was the first game in the series involving a gameplay element other than karaoke, allowing the use of a third party guitar controller such as those used in the Guitar Hero or Rock Band series.Tracklist:3 Doors Down - Kryptonite Bloc Party - Helicopter Blur - Song 2 Buzzcocks - Ever Fallen In Love With Someone Colbie Caillat - Bubbly David Bowie - The Man Who Sold The World Elbow - Grounds For Divorce Florence and the Machine - Kiss With a Fist Franz Ferdinand - No You Girls Jamiroquai - Too Young to Die Kaiser Chiefs - I predict a riot Kasabian - Fire KT Tunstall - Suddenly I See Ladyhawk - My Delirium Muse - Supermassive Black Hole Paramore - CrushCrushCrush Pixies - Debaser Pulp - Disco 2000 Queen & David Bowie - Under Pressure Stereophonics - Just Looking The Stone Roses - Waterfall The Clash - Rock The Casbah The Cult - She Sells Sanctuary The Cure - The Lovecats The Raconteurs - Steady As She Goes The Veronicas - Untouched The White Stripes - Fell In Love With A Girl Tina Turner - Steamy Windows U2 - Beautiful Day Vampire Weekend - A Punk",
"release_date":"Oct 15, 2010",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/wavw3yfe7fgd3jghqf4n.jpg"
},
{
"title":"Sex Adventures: The Spa",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Xbox One",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"A visual novel about a young woman's naughty adventures at her favorite SPA.",
"release_date":"Feb 21, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5kxk.jpg"
},
{
"title":"Piko-piko: Koisuru Kimochi no Nemuru Basho",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Xbox One",
"Android",
"Legacy Mobile Device",
"SG-1000"],
"game_description":"The story takes place in the near future. As globalization swept the world, almost all of industries in Japan declined. One and only industry that survived is moe industry and Japanese people get together and work hard to develop moe industry.",
"release_date":"Aug 29, 2008",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4rku.jpg"
},
{
"title":"Moonsweeper",
"platforms":[
"Commodore C64/128/MAX",
"ZX Spectrum",
"Atari 2600",
"ColecoVision",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"In Moonsweeper your goal is to rescue miners from the moons in Star Quadrant Jupiter. You begin your mission in space where you must avoid deadly aurora flares, photon torches and space bullets from the sun in this quadrant. From time to time you will see a moon pass by, and by flying near it you can descend to the surface. As you sweep along the surface, you will see stranded miners which need to be rescued by flying over them. Also on the moons surface are various obstacles which must be avoided or destroyed, such as towers and lunar satellites as well as alien surface destroyers. Should you survive and rescue six miners (the maximum your ship can carry), then you may take off from the surface by using the accelerator rings. There are several different types of moons found in this quadrant, each with a different level of difficulty. To help out, your ship is equipped with photon torpedoes and shields (though you will lose points while using the shield).",
"release_date":"1983",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/vzqb7tp6zmhduwvsha8g.jpg"
},
{
"title":"Perfect Gold: The Alchemy of Happiness",
"platforms":[
"PC (Microsoft Windows)",
"ZX Spectrum",
"Atari 2600",
"ColecoVision",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Perfect Gold: The Alchemy of Happiness is a short, coming-of-age yuri visual novel about two former friends who escape detention in order to celebrate the Sunflower Festival. Set in the magical city of Castlecoast, readers get to know Audrey Clary, an alchemy student and heiress who secretly dreams of a different life, and Marion LaRue, a rebellious elemental magic student in search of someone she once loved.",
"release_date":"Apr 19, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2yaj.jpg"
},
{
"title":"Vastynex",
"platforms":[
"PC (Microsoft Windows)",
"ZX Spectrum",
"Atari 2600",
"ColecoVision",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Thunder Force Inspired Shooter. Homages to retro shooting games.At the beginning of the game, you'll only be capable of shooting in front and behind your ship, but by acquiring weapons from the item carriers that appear during each stage, you'll gain access to lasers, homing shots and more.Defeating enemies in rapid succession increases the score multiplier gauge up to a maximum of x8, with larger and more durable enemies offering a speed-kill bonus equal to x4 of your current score multiplier (maximum x32).The ending can be reached by clearing all six stages, and you can watch a replay of your run from the main menu.",
"release_date":"Aug 28, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4a3p.jpg"
},
{
"title":"Breakage",
"platforms":[
"PC (Microsoft Windows)",
"ZX Spectrum",
"Atari 2600",
"ColecoVision",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Something weird has happened. You wake up in a dungeon, and the world seems a mishmash of fantasy, sci-fi and reality. You must find out what has happened and what is going to happen, and perhaps stop it.",
"release_date":"Dec 02, 2013",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3ppi.jpg"
},
{
"title":"Hearthstone: Saviors Of Uldum",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Android",
"iOS",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Saviors of Uldum is Hearthstone's twelfth expansion. Featuring 135 new collectible cards, it was released on August 6, 2019.Following the League of E.V.I.L.'s successful theft of the magical city of Dalaran, the nefarious evil-doers have turned to the land of Uldum, a place of vast deserts and ancient secrets. While the villains' ultimate goals are still a mystery, all is not lost: the brave League of Explorers−Reno Jackson, Elise Starseeker, Brann Bronzebeard, and Sir Finley Mrrgglton−have returned to save the world from Arch-Villain Rafaam and his cohorts.",
"release_date":"Aug 06, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1sh3.jpg"
},
{
"title":"Time Crisis 3",
"platforms":[
"PlayStation 2",
"Arcade",
"Android",
"iOS",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"The third installment in Namco's light gun shooting franchise, Time Crisis 3 offers exciting, fast-paced shooting action by the world renowned VSSE agents as they fight to save an innocent nation from total annihilation. Choose from four weapons--machine gun, handgun, shotgun, and grenade-- to blast your way past enemies. Practice your sharpshooting skills in Sniper Combat and multiple gameplay modes. The game also includes multiple gameplay modes, a new playable character, and the original Time Crisis. It's time to warm up that trigger finger and step into the action.",
"release_date":"2002",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2k61.jpg"
},
{
"title":"DejaVu",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A cute puzzle game playing with multiple parallel levels, looking a lot like each others. But there is more to meet the eyes...",
"release_date":"Apr 27, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4l2q.jpg"
},
{
"title":"Adagio",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A short VR experience, Adagio places the viewer in a dreamy, Celtic landscape in the brief moment of darkness right before dawn. Are they alone or accompanied? Some say that as dawn breaks, you can witness ghosts tasting the morning dew.",
"release_date":"May 23, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4l2q.jpg"
},
{
"title":"Cleo: A Pirate's Tale",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Cleo is a solo-developed, top-down, pixel-art, retro, pirate adventure with a lot of nostalgic flair, humor and a linear story, inspired by the old Zelda games and the classic LucasArts adventure games.",
"release_date":"Dec 12, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2o7s.jpg"
},
{
"title":"Where is cat?",
"platforms":[
"iOS",
"Mac",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"The collection of adventures of the Bonte cat who likes to play hide-and-seek.Find and tap on the black cat hidden in each room of the house and then find all the different items the cat wants for a little surprise at the end...",
"release_date":"Dec 10, 2015",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co29tv.jpg"
},
{
"title":"Clint is Not an Incel: A Word on Fatness and Masculinity",
"platforms":[
"Web browser",
"Mac",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A Bitsy essay on the perception of fat men in games and culture.",
"release_date":"Nov 17, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2n26.jpg"
},
{
"title":"Gummy Bear Runner",
"platforms":[
"Android",
"iOS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Explore the World and Space with the famous Gummy Bear! Run and keep running to collect gold, diamonds and special items and finish with the longest distance to get a high score! Play now the new free runner game for everyone.",
"release_date":"Mar 10, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4qo7.jpg"
},
{
"title":"SDI",
"platforms":[
"Handheld Electronic LCD",
"iOS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"SDI is an LCD game released by Sega in Japan as part of the Game Vision series. Though Sega intended for linked with the arcade game SDI, it is in fact a retooled version of Tiger Electronics' 1989 LCD 'Super Sound' handheld, Space Fight (not to be confused with an earlier handheld from the company with the same name).",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4p5u.jpg"
},
{
"title":"The Dark Pictures Anthology: Volume 1 - Limited Edition",
"platforms":[
"PlayStation 4",
"iOS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Box contents:- Xbox Game: The Dark Pictures - Little Hope- Xbox Game: The Dark Pictures - Man of Medan- Dark Pictures Cloth Map- Map Pins- Steelcase",
"release_date":"Oct 30, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2o7b.jpg"
},
{
"title":"Fire & Water",
"platforms":[
"Nintendo Switch",
"iOS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Fire & Water is a game where you use the power of fire and water in order to solve various puzzles. Both Water Girl and Fire boy are working together to solve a vast range of different, exciting puzzles all the time. Controlling the two characters is very simple, and you must help Fire boy avoid water, while Water girl needs to avoid fire. There’s also black water that can kill both of them. You will need to use mirrors, elevators, wind machines, pulleys, black balls and a variety of other tools in order to complete these tasks. The faster you do that, the better it will be. Features: Impressive puzzle gameplay More than 30 maps to play through Use pulleys, wind machines and elevators Escape the maze and win",
"release_date":"Nov 19, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co57nj.jpg"
},
{
"title":"Radio General",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"It's WW2. You're a general sitting in a tent. All you have in front of you is a map, and a radio. Can you win the battle? Radio General is a unique strategy game where you interact with your units over the radio using speech recognition. Test your mettle and relive famous battles as a WW2 general.",
"release_date":"Apr 09, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2ch1.jpg"
},
{
"title":"Petz: Horsez 2",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo DS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Saddle up for fun in a game that combines your passion for horses with thrills and adventure! You'll be rewarded for raising horses, training champions, and saving the ranch in Petz horsez 2.",
"release_date":"Jun 13, 2008",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2yid.jpg"
},
{
"title":"TrapBot",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo DS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"TrapBot is a dynamic 2D action hardcore platformer in an urban style",
"release_date":"Nov 12, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5nn8.jpg"
},
{
"title":"Broken Circle",
"platforms":[
"Game Boy Advance",
"Nintendo DS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Broken Circle is an unreleased RPG. The game, which story was based on Nordic mythology, had a troubled development: publishers weren’t interested because it was too risky to cover the release costs for an unknown title that needed a big and expensive 256mbits cartridge.By the time that the programmers managed to shrink Broken Circle to 64mbits, the console was at the end of its life and the only publisher interested in the game was not officially authorized by Nintendo.",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5b2k.jpg"
},
{
"title":"SnowRunner: Scorched Vinyl Wrap",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo DS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Explore SnowRunner in style with the unique Scorched Vinyl Wrap for the Chevrolet CK 1500.The Scorched Vinyl Wrap adds a fiery burst look to the Chevrolet CK 1500.",
"release_date":"Apr 27, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co30la.jpg"
},
{
"title":"Pachi-Slot Aruze Ōkoku 5",
"platforms":[
"PlayStation",
"Nintendo DS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"The fifth entry in the Pachi-Slot Aruze Ōkoku series.",
"release_date":"Nov 15, 2001",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/lfrvculxznexmnmbpo3t.jpg"
},
{
"title":"Landlord's Super",
"platforms":[
"PC (Microsoft Windows)",
"Nintendo DS",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Your quintessential construction simulator is here. Take a dodgy loan, restore a property, move in the locals, attend to their grievances, then celebrate with a pint in this fully-simulated, open-world 1980's Britain.",
"release_date":"Apr 30, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co243j.jpg"
},
{
"title":"Disney Infinity: 2.0",
"platforms":[
"Wii U",
"Xbox One",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"In Disney Infinity: Marvel Super Heroes, players will use real-world interactive Marvel figures to activate original storylines (Play Sets) in the virtual game worlds of some of Marvels most popular franchises, including The Avengers. In the Play Sets - penned by award-winning Marvel comic writer Brian Michael Bendis - players will be able to take on the role of more than 20 Marvel characters including Captain America, Iron Man, Black Widow, Thor, Hulk and Hawkeye to battle enemies, complete challenging missions, solve puzzles and ultimately save the world from destruction.",
"release_date":"Oct 23, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1rxo.jpg"
},
{
"title":"Stone Flower",
"platforms":[
"PC (Microsoft Windows)",
"Xbox One",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"This is an incredible journey through an abandoned city, in search of an ancient artifact.",
"release_date":"Sep 20, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1rxo.jpg"
},
{
"title":"Chaos Galaxy 2",
"platforms":[
"PC (Microsoft Windows)",
"Xbox One",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A turn-based Galaxy totalwar game. Choose one of 12 factions, direct dozens of admirals, control hundreds of warships, mecha and monsters, set up various buildings, study technology, and lead fleets to carry out grand strategic actions on the map of the galaxy.",
"release_date":"Jul 25, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3n03.jpg"
},
{
"title":"Crysis: Special Edition",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"This Special Edition includes: Crysis, a bonus DVD with the 'Making of Crysis', trailers and concept art, an art booklet, the official soundtrack by Inon Zur and an exclusive in-game-vehicle for multiplayer matches.",
"release_date":"Nov 16, 2007",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2on9.jpg"
},
{
"title":"Spike Out",
"platforms":[
"Arcade",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Spikeout: Digital Battle Online is a 3D beat 'em up video game developed by Sega-AM4 and published by Sega in 1998. An update, Spikeout: Final Edition, was released in 1999.",
"release_date":"Feb 01, 1998",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4gj8.jpg"
},
{
"title":"Fengse Huanxiang 3: Zui yu Fa de Zhenhunge",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"**This game is playable in Chinese only**The 100-year battle between humans and ghosts ended when the hero Jiaseduo used the seven magical emblems to seal the leaders of the ghosts. But those ghosts were symbols of nature. Although the humans won the battle, their crime against the nature brought punishment. After the death of Jiaseduo, the seven emblems broke the curse and were released into the world. 92 years after the Ghost War, the humans were threatened once again. North Empire and South Republic united at the sight of a common enemy. The Holy Fire King called the best fighters in those two countries, and they formed an organization called 'Duan Zui zhi Yi' - 'Sin-Breaking Wings'. Led by the young and beautiful girl Karin Seraphim, the fighters are now ready for their greatest battle ever...",
"release_date":"Feb 2004",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5yfx.jpg"
},
{
"title":"Heartomics: Nokori",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Heartomics: Nokori is a game where you raise a hero then you go explore with said hero.",
"release_date":"Mar 25, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5yfx.jpg"
},
{
"title":"Up in the Air",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Up in the Air is a zany, open-world game in which you play a balloon dog exploring a demented carnival populated by crazy children. Players must use a variety of power ups, from water balloons to ground pound, to fend the kids off and collect carnival tickets.",
"release_date":"Feb 21, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1zzu.jpg"
},
{
"title":"At Your Service",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"At Your Service is a wacky co-op party game you can play with up to four players. Visit chaotic futuristic and fantasy themed homes and get them tidy any way you can! Whether it’s an angry magician or a grumpy dad trying to slow you down, just make sure you make a clean getaway!",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5931.jpg"
},
{
"title":"Fursan al-Aqsa: The Knights of the Al-Aqsa Mosque",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 3",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Fursan al-Aqsa: The Knights of the Al-Aqsa Mosque is an Action Game on which you play as Ahmad al-Falastini, a young Palestinian Student who was unjustly tortured and jailed by Israeli Soldiers for 5 years, had all his family killed by an Israeli Airstrike and now, after getting out from prison, seeks revenge against those who wronged him, killed his family and stolen his homeland, by joining a new Palestinian Resistance Movement called Fursan al-Aqsa: The Knights of the Al-Aqsa Mosque.",
"release_date":"Apr 18, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co41lq.jpg"
},
{
"title":"Lost Labyrinth Extended Version",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Xbox 360",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Lost Labyrinth is a coffeebreak dungeon crawling game!",
"release_date":"Nov 24, 2015",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co41lq.jpg"
},
{
"title":"Gnosia",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation Vita",
"Nintendo Switch",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Gnosia is a Sci-Fi Social Deduction RPG in which you will engage in discussion with a variety of unique characters, with the aim of identifying the Gnosia among the group. Players will have to use what information they can gather during the discussions to ascertain whom they think is Gnosia and then vote to put them into cold sleep. As you progress, your abilities will improve - but so will those of the crew.As the numbers of crew members, Gnosia, and various “roles” increase, it will become increasingly difficult to determine who is telling the truth. Work in collaboration with or against other crew members to ensure your survival until the end.",
"release_date":"Jun 20, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2ga1.jpg"
},
{
"title":"Stop - Categories Word Game",
"platforms":[
"iOS",
"PlayStation Vita",
"Nintendo Switch",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Stop is a fun and clever turn based game you play with friends. Randomly select a letter to start and type a word for each of the 5 different categories that starts with that letter. The player that gets most correct words wins!",
"release_date":"Jan 29, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/kikoujjhyz4ejjqqe6zv.jpg"
},
{
"title":"Banana Treasures Island",
"platforms":[
"Nintendo Switch",
"PlayStation Vita",
"Nintendo Switch",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Welcome to the Banana Treasures Island, and begin your journey of funs. Run, jump, swim, and fly all the way through Banana Islands and fight the angry baboon and his minions. Help the baby monkeys and companion in the jungle quest! Dash through the jungle, smash the enemies and complete the level to unlock more! Collect as many bananas gold coins as possible to unlock more items, get specials, upgrades, and power-ups... find the super golden banana to break the evil spells that possess islanders!",
"release_date":"Oct 27, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co571x.jpg"
},
{
"title":"Color Cube Spin",
"platforms":[
"Android",
"PlayStation Vita",
"Nintendo Switch",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Endless game to master your spatial orientation, speed of judgment and coordination of moves to find right side of cube.    Spin with cube and find right color to match next obstacle color.",
"release_date":"May 15, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/ygp2qp87mrcvys1pj6up.jpg"
},
{
"title":"Warhammer 40,000 : Armageddon - Ork Hunters",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Nintendo Switch",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Ork Hunters is an expansion of Warhammer 40,000: Armageddon, set shortly after the end of the Second War of Armageddon, and it adds a new chapter to this epic saga!",
"release_date":"Nov 05, 2015",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3ce3.jpg"
},
{
"title":"AntharioN",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Nintendo Switch",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Antharion is an epic old-school fantasy RPG that combines tactical turn-based combat with the freedom of a huge living-breathing open world. You'll create and customize a party of four: choosing from seven races, nine classes and fifteen skills, before setting out to explore the fully interactive continent of Antharion. Explore dungeons, get thrown in jail, discover hidden passageways, burglarize homes, read books, create potions, become and infamous pickpocket, embark on a journey at sea and discover uncharted islands or persuade NPCs to do your bidding. In Antharion no play style is off limits.",
"release_date":"Jun 03, 2015",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/ly3k2g96awbmgeby6lqk.jpg"
},
{
"title":"Axiom Alternative II",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Sacking an employee from The Violet Hotel soon becomes unwanted news on Grendel's malicious web blog. Can the protagonist stop Grendel from causing further problems ?",
"release_date":"Jun 09, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co45ug.jpg"
},
{
"title":"Basha Tarneeb",
"platforms":[
"PlayStation 3",
"PlayStation Portable",
"PlayStation Vita",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Basha Tarneeb brings the popular 4-player trick-taking card game to the minis platform. Partner up with the game AI and play against the rival team in this game of wit and strategy. The game puts the player in an atmosphere of playing with old friends, with rich arabesque visuals that stem from traditional game boards and tables from the Arabian region.",
"release_date":"2011",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1tu3.jpg"
},
{
"title":"Healslut",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation Portable",
"PlayStation Vita",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Jack in, jack off!The story of a cynical recluse of a beta tester who sets out to try a new online game with a full immersion system. The catch is that the game imposes a peculiar class of a healer that heals with sexual excitement. And that's not speaking about the party members who are quite literally sex-crazed deviants. The border between worlds begins to feel marred meanwhile. What's going on here is for player to find out.",
"release_date":"May 04, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5acm.jpg"
},
{
"title":"Satan Loves Cake",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation Portable",
"PlayStation Vita",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"SATAN LOVES CAKE.Like, a lot. But one day, while watching the telly, he realises that he has run out of cake. Join SATAN in a delicious quest through (a bit of) Hell, while eating as much CAKE as possible!SATAN wields a trident that shoots electric beams, that are able to tramsform his enemies into cake. Meet a host of enemies and bosses - and eat them all!",
"release_date":"Aug 13, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2d9b.jpg"
},
{
"title":"Not It: Spookiest Edition",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A horror-filled visual novel full of suspense and mystery where you navigate Katie through a living nightmare. Her move-in day on Halloween throws her into a centuries-old curse. Can she make it through the night? Will her new neighbors perish? Decide their fate.",
"release_date":"Oct 12, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3zbc.jpg"
},
{
"title":"When There Is No More Snow",
"platforms":[
"PC (Microsoft Windows)",
"DOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"HYPER LOW RES SUPER RETRO visual novel made in ZZT with teen angst, saxophones, and UFOs.",
"release_date":"Apr 28, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4b58.jpg"
},
{
"title":"Deflector: Specimen Zero",
"platforms":[
"PC (Microsoft Windows)",
"DOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Deflector: Specimen Zero is a high-octane bullet hell roguelite set in a deadly world. Upgrade your character with the DNA you find, evolve him further during your runs and explore the farthest reaches of this microcosm… or die trying.",
"release_date":"Dec 09, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5g44.jpg"
},
{
"title":"Gamedle",
"platforms":[
"Web browser",
"DOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Guess the videogame by its cover, every day a new game.You can also try the Unlimited mode to play non-stop.",
"release_date":"Apr 30, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4v22.jpg"
},
{
"title":"Firegirl: Hack 'n Splash Rescue",
"platforms":[
"PC (Microsoft Windows)",
"DOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Take on the role of a young rescue officer starting her career. Armed with a trusty axe and high-pressure fire hose that also acts like a jetpack, Firegirl responds to emergency calls across the city. Can Firegirl save all the trapped civilians caught in each blaze?",
"release_date":"Dec 14, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3nk1.jpg"
},
{
"title":"Hearts of Iron II: Armageddon",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Hearts of Iron II: Armageddon is an alternate scenario expansion for Hearts of Iron II. It further allows more time and the player has the ability to choose 1964 as the end point. It allows the adding of modules to ships (such as improved radar, fire-control, anti-submarine or anti-aircraft weaponry) and submits two new scenarios for play, as well as an enhanced AI.Armageddon also features some other changes and additions such as:*Player can allow or disallow democracies to declare war on the main menu options screen*Player may choose when the time of play will end, ranging as early as 1940 to as late as 1964.*Player may choose to get the full industrial capacity of an annexed country, or not.*Player may choose to use tech teams of an annexed country or not.*New brigade attachments for ships.*Diplomatic option to refuse expeditionary forces from your allies",
"release_date":"Apr 2007",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/dpupqv6c2yu3psb1cxtl.jpg"
},
{
"title":"BMP Puzzle",
"platforms":[
"Philips CD-i",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"German jigsaw puzzle game with a variety of images and themes. Requires the Digital Video Cartridge to be installed into the Phillips CD-i.",
"release_date":"1994",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5aci.jpg"
},
{
"title":"8-Bit Attack",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A turn based tactics game where the player commands a cast of unique heroes as they travel across space and time in order to power up and defeat the evil lord Cthulhu. Build up your party by destroying mini-bosses and their lackeys in preparation for the final battle to save the universe!",
"release_date":"Jul 15, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2ct5.jpg"
},
{
"title":"Neverwinter Nights: Pirates of the Sword Coast",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Neverwinter Nights: Pirates of the Sword Coast is a Premium module for Neverwinter Nights. It features a new storyline to play but has no technical improvements to the main game and previous add-ons. The story begins in the city of Neverwinter, and leads to a lengthy ship-borne, swashbuckling-style adventure",
"release_date":"Jun 22, 2005",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1t1s.jpg"
},
{
"title":"Evil Maze",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Random Iiem and Skills + Hidden elements RPG + Strategy ARPG The game starts in a dark underground maze where a female officer is confined in a prison. She wants to get out of this nightmare maze! Would you like to help her?",
"release_date":"Jun 17, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3xsj.jpg"
},
{
"title":"RIDE 4: Ultimate 2020",
"platforms":[
"Xbox One",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Buy Ultimate 2020 and expand your gaming experience with 5 exclusive bikes and 10 extra events.",
"release_date":"Dec 18, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3m6h.jpg"
},
{
"title":"Dancing Stage Max",
"platforms":[
"PlayStation 2",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Dancing Stage Max was released on November 25, 2005 by Konami to the European PlayStation 2 gaming audience. Dancing Stage Max was modeled after Dance Dance Revolution Extreme 2 in America and Dance Dance Revolution Strike in Japan, containing the new Dance Master Mode and improved EyeToy support. Max featured music by Natasha Bedingfield, Sugababes and Franz Ferdinand as well as new and old Konami Originals. Unlike the previous release, Dancing Stage Fusion, Max was not ported to the arcades.",
"release_date":"Nov 25, 2002",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5tye.jpg"
},
{
"title":"Lords of the Fallen: Demonic Weapon Pack",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A set of three powerful, demonic weapons: The sword IHIR (“the one who”) for attack and defense. Twin daggers MARGYR (“friends”) that excel in all-out attack. The hammer THEHK (“thief”) able to steal magical energy.",
"release_date":"Oct 28, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/rfhymglylmoejqowwypd.jpg"
},
{
"title":"Rebirth of Fortune",
"platforms":[
"iOS",
"Mac",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Rebirth of Fortune is a tactical strategy role-playing game with customizable unites! Up to eight of your units battle hoards of mercenaries in turn-based, strategic combat on various terrains. Upgrade and customize your own units to compete in a chess-like strategy game of position and power. Your eight individual units share a mutual relationship and utilize various strategies and skills according to their disposition. A divisive strategy is required to beat each of 200 stages and various enemy AIs. If you eradicate the enemy you will be rewarded, and using the rewards fund you can upgrade your units and prepare for greater combat.",
"release_date":"Dec 14, 2009",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/rfhymglylmoejqowwypd.jpg"
},
{
"title":"Pinball Arcade: Stern Pack 3",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Pinball Arcade: Stern Pack 3 contains the following tables:- Big Buck Hunter- Whoa Nelly!- Big Juicy Melons",
"release_date":"Sep 15, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co52u1.jpg"
},
{
"title":"Reigns: Beyond",
"platforms":[
"Mac",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Reigns: Beyond challenges players to navigate the cosmos as an intergalactic indie rock band, plotting their rise to *star*dom, traveling from planet to planet and gig to gig on their quest for fame and fortune. Play local (and not-so-local) clubs throughout the galaxy, recruiting alien band members along the way, and rock out across the universe! But make sure you're managing your ship's resources and keeping your crew in check while on this interstellar tour because one wrong decision may leave you dead in space!  FEATURES - Unlock the legendary Galactic Guitars and rock out in front of your adoring fans. - Fight pirates, overzealous tax collectors and more in swiping dogfights. - Hang out on your ship for band practice and offer directions to lost space travelers. - Meet 60+ curious characters, including your manager, Lord Shark, Strombo the scholarly mollusk, Gron the space bear, ... and of course your crew and your ship's know-it-all A.I. - Over 1400 decision cards. Infinite possibilities! - Original soundtrack by Sam Webster (GRINDSTONE)",
"release_date":"Nov 06, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2iif.jpg"
},
{
"title":"Into the Dungeon",
"platforms":[
"iOS",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Explore Dungeons, Solve Puzzles, Fight Monsters and collect some Loot!",
"release_date":"May 15, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4ujm.jpg"
},
{
"title":"Blankspace",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Blankspace is an escape room visual novel with point-and-click elements. Interact with Beryl, investigate your surroundings, solve puzzles, and find your way out of a strange-looking room!",
"release_date":"Jul 23, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4s12.jpg"
},
{
"title":"LifeGameSimulator",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"How the extremely complicated universe made with simple 16 particles?This life game will be short explanation of that.Simple rule to the complicated results.",
"release_date":"May 31, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4s12.jpg"
},
{
"title":"Uncharted: Legacy of Thieves Collection",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 5",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Are You Ready To Seek Your Fortune?Seek your fortune and leave your mark on the map in the UNCHARTED: Legacy of Thieves Collection. Uncover the thrilling cinematic storytelling and the largest blockbuster action set pieces in the UNCHARTED franchise, packed with all the wit, cunning, and over the top moments of the beloved thieves – Nathan Drake and Chloe Frazer.In an experience delivered by award winning developer Naughty Dog can, the UNCHARTED: Legacy of Thieves Collection includes the two critically-acclaimed, globe-trotting single player adventures from UNCHARTED 4: A Thief’s End and UNCHARTED: The Lost Legacy. Each story is filled with laughs, drama, high octane combat, and a sense of wonder – remastered to be even more immersive.",
"release_date":"Jan 28, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3swl.jpg"
},
{
"title":"Aeron's Golden Cookie Quest",
"platforms":[
"Super Nintendo Entertainment System",
"PlayStation 5",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Total conversion hack of Super Mario World by Anorakun.",
"release_date":"May 24, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4uh1.jpg"
},
{
"title":"Hot Milf 4",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 5",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Hentai is not just 2D girls, this is a whole art.",
"release_date":"Mar 05, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5eev.jpg"
},
{
"title":"VR Treasure Raider",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 5",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"After years of research, the entrance to an ancient island has been discovered. Beyond its doors are rumored to be riches guarded by cunning monsters and lethal traps. Be wary or be entombed. Good luck and have fun with virtual reality.",
"release_date":"Jan 15, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co46nk.jpg"
},
{
"title":"Hyper Universe",
"platforms":[
"PC (Microsoft Windows)",
"Xbox One",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Leap into action with the most intense side-scrolling MOBA to hit the market and join the battle-ready Hypers as you hone their insane power and compete in order to unlock the salvation of the universe.",
"release_date":"Jan 17, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1u3s.jpg"
},
{
"title":"Mortyr II",
"platforms":[
"PC (Microsoft Windows)",
"Xbox One",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Mortyr II is set during World War II and follows British intelligence officer Sven Mortyr, who is sent to his Nordic homeland to investigate rumours of a Nazi super-weapon. Sven is horrified to find his own father has been forced to work on the unit, and must thus use all his covert skills to infiltrate the Nazi stronghold and prevent the completion of the weapon and rescue his father.",
"release_date":"Mar 01, 2005",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co25gl.jpg"
},
{
"title":"Behind Zombie Lines",
"platforms":[
"Android",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"The apocalypse is here and you are stuck behind zombie lines. Here, the time is limited and you cannot afford to stop. To stay alive, you must shoot your way through the hungry hordes of the undead. Do remember, your gun is your only friend here because, between the zombies and you, only one can survive.  Get involve yourself in a thrilling Zombie Survival Game. Keep your defense and shoot zombies in FPS view.  How to Play: -------------------------------------------- - Shoot Zombies with different guns - Upgrade weapons - Experience the 3D shooting thrill - Run as much as you can to be at the top  Features: -------------------------------------------- - Easy and intuitive controls - Stunning graphics with lighting and post-process effects - Explosive fun that will leave your heart pounding - Enjoy the multiple modes - 3D characters and environments with an unprecedented level of detail  The Best FPS Zombie Survival Shooting Game on Mobile! Play Now for FREE and share your REVIEWS!",
"release_date":"Jul 27, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/uhmlnypaiou5cy5ysiof.jpg"
},
{
"title":"Alto's Odyssey: The Lost City",
"platforms":[
"Mac",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Join Alto and his friends on an endless sandboarding journey to find The Lost City and unearth the secrets hidden within. Soar above windswept dunes, traverse thrilling canyons, explore ancient temples and delve into vast caverns in a fantastical place far from home.On this journey, you’ll grind across vines, bounce atop hot air balloons, ride towering rock walls, glide in your wingsuit, and escape mischievous lemurs – all while uncovering the desert’s many mysteries.Explore a new and unique biome with special hidden challenges, layered among the classic Alto’s Odyssey experience long-term fans know and love.",
"release_date":"Jul 16, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3ggz.jpg"
},
{
"title":"The Puzzle Box Society",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"Welcome to The Puzzle Box Society. Break in, bypass their security systems, find the secret areas, steal the valuables, and get out.",
"release_date":"Feb 10, 2020",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2m1z.jpg"
},
{
"title":"Spider Lander",
"platforms":[
"PC (Microsoft Windows)",
"iOS",
"Web browser",
"Web browser",
"Texas Instruments TI-99",
"SG-1000"],
"game_description":"A loving echo of games from the 80's and familiar to those who loved classics such as Lunar Rescue and Lunar Lander. Swing on a thread from your mothership and thrust safely down to rescue some of those poor guys on the planet, then try to escape safely.",
"release_date":"Nov 15, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2m1z.jpg"
},
{
"title":"Monty Python's Flying Circus: The Computer Game",
"platforms":[
"DOS",
"Commodore C64/128/MAX",
"Amiga",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"You control Mr. D.P Gumby and, understandably, you have to get back his 4 pieces of brain. This is not easy. If it was, this game would not be a game of skill and fun, now would it?There are four skill levels to this game, a piece of brain is being held on each skill and fun level. The levels are all quite different in a skill and fun sort of way, but all have different things in common. Good things like sausages, eggs, beans, spam (skill) and cheese (fun) and bad things like dead parrots.Because each level is quite different in a skill and fun sort of way, Mr. Gumby cannot always walk, so, his body is changed to suit the surroundings. Like on the first level, where he is changed into a fish to swim in the maze like underwater caverns.When each level runs out there is no more, Mr. Gumby is changed back to normal (well normal for him) and he is sick, all the good things picked up along the way go in a big hole and are counted for points. Best of all though if you got 16 lots of spam Mr. Gumby can have a piece of his brain back. Then you have to do it all again.",
"release_date":"1991",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/cfmjbjccyinyqqhhzvmc.jpg"
},
{
"title":"World Conqueror X",
"platforms":[
"Nintendo Switch",
"Commodore C64/128/MAX",
"Amiga",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"EasyTech brings its studied and skillful approach to World War II strategy gaming with World Conqueror X on Nintendo Switch.",
"release_date":"Mar 08, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5ai7.jpg"
},
{
"title":"Frequent Flyer: A Long Distance Love Story",
"platforms":[
"PC (Microsoft Windows)",
"Commodore C64/128/MAX",
"Amiga",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Emi falls in love with Isobel on her vacation, but Isobel is hiding secrets that will shake Emi to her very core... do you trust her?",
"release_date":"Mar 12, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5ai7.jpg"
},
{
"title":"Medieval Arms",
"platforms":[
"PC (Microsoft Windows)",
"Commodore C64/128/MAX",
"Amiga",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Medieval Arms is a third person, action slasher game. Engage in hack and slash action vs NPCs, as well as holding control points to win.",
"release_date":"Nov 11, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5l88.jpg"
},
{
"title":"My Little Baby",
"platforms":[
"Wii",
"Commodore C64/128/MAX",
"Amiga",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Have you always dreamed of having a cute little baby to lovingly care for?",
"release_date":"Feb 18, 2011",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/kzo5oc6ogr6k6e3hjx8c.jpg"
},
{
"title":"Defiance 2050",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"'Defiance 2050 is a futuristic free to play online shooter set in an extraordinary post-apocalyptic world with advanced alien technology. Fight on your own or alongside friends as you explore and unlock powerful weapons with extensive skill and customization systems.'  For the 5th anniversary of Defiance the game is being remade from the ground up.  Some account information will be transferable from the original game. Account based purchases like character and loadout slots as well as specific unique titles, such as “Old School”, will also be transferred over. A reward system is also going to be added to the original game with players earning Valor which will also be usable in some way. More information on this system will be revealed later.",
"release_date":"Jul 10, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co28qx.jpg"
},
{
"title":"Art of Not Getting Found",
"platforms":[
"PC (Microsoft Windows)",
"Web browser",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Sometimes the only way of getting to your destination is by getting lost...",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co28qx.jpg"
},
{
"title":"Factory of Monsters",
"platforms":[
"PC (Microsoft Windows)",
"Web browser",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"A big and strange factory suddenly apeares in the city. Monsters emerge here and there.Officer of Star Troops, Su Anya, will come to the earth to help the army in the city.When she arrives at the destination,howerver, forests, mountains, and magic lives stop her marching forward...",
"release_date":"Jun 18, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co28qx.jpg"
},
{
"title":"SBK 2011: Superbike World Championship",
"platforms":[
"PlayStation 3",
"Xbox 360",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"SBK 2011 pushes the SBKFIM Superbike World Championship franchise to the limit. Always keeping the focus on realism, simulation and accessibility, this brand new version is faster, more exciting and with more adrenaline than ever before.The driving model has undergone a series of major changes, succeeding in what seemed to be impossible: the game is now more realistic and at the same time it’s easier and more satisfactory for both newbie and seasoned players. Three levels of realism are available to let the player customize their riding experience, building at the same time a smooth learning curve.Playing with the Low Sim is perfect to learn the tracks and the bike behavior, Medium Sim model eases the reactions of the powerful SBK bikes, but leaves to the player the possibility of doing incredible late braking maneuvers, Full Sim gives the player the full control of the monster machines of the game. Before getting to the track, the player can set up his bike in the pits using all the options that a real race rider can use. If he doesn’t know how to improve his bike, an engineer is available to do the right fixes based on the player feedback about bike handling. All the player has to do is to tell how handling his bike felt and the engineer will do the setting changes he needs.",
"release_date":"Jun 13, 2011",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1lck.jpg"
},
{
"title":"Megami Paradise 2",
"platforms":[
"PC-FX",
"Xbox 360",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Megami Paradise 2 is a sequel to Megami Paradise released by PC Engine in 1994. Megami Paradise was an RPG game, but Megami Paradise 2 is a battle simulation game.",
"release_date":"Jul 26, 1996",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4hhe.jpg"
},
{
"title":"The Long Road North",
"platforms":[
"PC (Microsoft Windows)",
"Xbox 360",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"A story-driven game supported by the song Cold Burn from Cult Of Luna",
"release_date":"Apr 28, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5n7k.jpg"
},
{
"title":"Personal Trainer: Walking",
"platforms":[
"Nintendo DS",
"Xbox 360",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Nintendo has trained people's brains and made fitness fun. Now Personal Trainer: Walking gives the simple act of walking a high-tech twist.",
"release_date":"May 27, 2009",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/ypzxyrluth9f14esyvj4.jpg"
},
{
"title":"Punch the Monkey! Game Edition",
"platforms":[
"PlayStation",
"Xbox 360",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"A rhythm game featuring music from a series of Lupin III remix albums.",
"release_date":"Jun 22, 2006",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5kzf.jpg"
},
{
"title":"Destroy The World",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Destroy buildings, cars, trees! Use the destructive force of nuclear power plants to your advantage! Melt the ice caps! Kill all the baby seals! Raise the ocean levels! Burn down the rain forest & destroy every cultural site in your way! Cause great oil spills and disrupt threatened ecosystems!",
"release_date":"Feb 08, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5kzf.jpg"
},
{
"title":"Cat Frenzy",
"platforms":[
"Nintendo DSi",
"Mac",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Slide & Match adorable kittens to set them free in over 101 levels full of puzzles and purrs!",
"release_date":"Jun 07, 2012",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/kp6jzffxmpqstnwfwtwl.jpg"
},
{
"title":"Electroplankton Beatnes",
"platforms":[
"Nintendo DSi",
"Mac",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Beatnes are curious plankton with geometrically shaped heads that form vertical strands like seaweed.",
"release_date":"Nov 09, 2009",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/hwp3n6ltpvfvwplgp1s7.jpg"
},
{
"title":"Living Legends: Ice Rose",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Edward Grand, a novelist, finds evidence of a tragedy that has occurred in the city of Rosemont and sets out to uncover what has happened.",
"release_date":"Mar 22, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/bqi5dpsvecd0okm2eyhw.jpg"
},
{
"title":"Bushi",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Xbox One",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Wield your bow and sword against fierce opponents as you navigate obstacles with dynamic parkour in the samurai-themed arena brawler, Bushi! Inspired by the cult classic GunZ The Duel and The Legend of Son-Goku.",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4cbr.jpg"
},
{
"title":"Lock-On",
"platforms":[
"DOS",
"Arcade",
"Atari ST/STE",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"This Taito-published soccer game, released in arcades in 1986 and for the Famicom Disk System in 1988. It was not released outside of Japan.",
"release_date":"1986",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/qxdsjwexyg8vj4i3xgvm.jpg"
},
{
"title":"The Lost Robot: Jigsaw Puzzle Stories",
"platforms":[
"PC (Microsoft Windows)",
"Arcade",
"Atari ST/STE",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Find help for a lost robot by restoring its memory.",
"release_date":"Jun 24, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co43y9.jpg"
},
{
"title":"Wrought Flesh",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Amstrad CPC",
"ZX Spectrum",
"SG-1000"],
"game_description":"Rip out organs and equip them in your own body. Fight biopunk monsters and drugged-up space bandits. You are a Gajeshian Cultist: A near-mythological being built from the bodies of long-dead saints.",
"release_date":"Dec 10, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4a6f.jpg"
},
{
"title":"NBA 2K7",
"platforms":[
"PlayStation 2",
"PlayStation 3",
"Xbox",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"NBA 2K7 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It is the eighth installment in the NBA 2K franchise and the successor to NBA 2K6. It was released in September 2006 for Xbox, Xbox 360, PlayStation 2, and PlayStation 3. Shaquille O'Neal is the cover athlete of the game. NBA 2K7 is the predecessor to NBA 2K8 in the NBA 2K series.  The game strives to simulate the experience of the National Basketball Association and attempts to be as realistic as possible. Players play NBA basketball games with real life teams in a variety of game modes. Players may customize the gameplay, as well as the players, and can take control of an NBA team as the general manager, hiring coaches, and making a profit. The game features all the main aspects found in the NBA, such as commentary, realistic crowd animations, and halftime shows. The game's overall gameplay, as well as the aesthetics, was said to have been significantly improved before release.  NBA 2K7 received a positive reception upon release. A lot of praise was directed at the game's overall presentation; some critics called the visuals 'gorgeous', while others said it was 'spectacular' and achieved great 'visual feats'. Most other praise was directed at the game's improved gameplay, as well as the depth and wealth of content. Some negative comments were made concerning the models and animations of the players.",
"release_date":"Sep 25, 2006",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co257s.jpg"
},
{
"title":"Scary Humans",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"Experience the game at its fullest intensity in this procedural survival! Enjoy its retro style while challenging yourself on a wild difficulty of levels, just as the 80s games were. Will you be able to find a way out of an MIC and escaping from those scary humans?",
"release_date":"Oct 26, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co257s.jpg"
},
{
"title":"Sticky Balls",
"platforms":[
"iOS",
"PC (Microsoft Windows)",
"Mac",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"Sticky Balls is an action puzzle game published by Gizmondo Studios and developed in Manchester and designed by John and Ste Pickford. Sticky Balls uses a pool-like interface where the player utilizes a spring-loaded rod to shoot brightly colored balls at each other. Bouncing the balls against the table walls doubles the score of the shot but hitting a ball of a different color, or failing to hit anything causes the player to lose a turn.",
"release_date":"May 23, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4jwv.jpg"
},
{
"title":"Kometen",
"platforms":[
"iOS",
"PC (Microsoft Windows)",
"Mac",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"A comet has been born, please take good care of it! Explore the universe and learn how to fly in a graceful way. A beautiful and memorable experience for everyone!",
"release_date":"May 12, 2010",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4jwv.jpg"
},
{
"title":"Touhou Gensou Rambu: Yuujou, Uragiri, Shouri",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"A doujin game by CAPRICORN based on the Touhou Project series.",
"release_date":"May 10, 2015",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4vis.jpg"
},
{
"title":"Heart of Saphilamun",
"platforms":[
"PC-98",
"PC (Microsoft Windows)",
"Mac",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"Sequel to Horror of Cridewell.",
"release_date":"1991",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5yfu.jpg"
},
{
"title":"Plutos",
"platforms":[
"Amiga",
"Super Famicom",
"Atari ST/STE",
"Xbox 360",
"ZX Spectrum",
"SG-1000"],
"game_description":"Plutos is a long lost unreleased prototype developed by Tynesoft for the Atari 7800, and appears to be a loose port of the ST/Amiga game of the same name. The existence of Plutos has been known for some time, as a physical prototype has been in hands of a collector for years, but this prototype was known to be unstable and crash frequently. The source code for Plutos was discovered in 2008 and several 7800 enthusiasts were able to get it compiled and running properly on stock 7800 hardware.  Plutos is a vertically oriented space shooter that features gameplay similar to Raiden. The game features six different levels, each with its own unique theme and boss. Only three of these levels are unique graphically--the other three are just color palette changes. Plutos offers one player as well as two player simultaneous modes, selectable with the left difficulty switch. Plutos also has features a unique weapons power-up system. There are three different types of weapons, each of which can be upgraded up to four times, as well as an invincibility power-up. The three different weapons are: Dual machine guns, spread gun, and energy gun.  A partially compiled version of Plutos was discovered by Curt Vendel, and thanks to the efforts 7800 enthusiasts Robert DeCrescenzo, Mitchell Orman, and Eckhard Stolberg, made playable on 7800 hardware. It's a shame that Plutos was not released as it was obviously very close to completion and would have been a boost to the 7800 library.",
"release_date":"1987",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/s4lnfdlwomgqwpsvmhlx.jpg"
},
{
"title":"HITMAN: Episode 5 - Colorado",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"With four targets to take out, the 'Freedom Fighters' mission delivers an intense infiltration mission that forces players to evolve trusted tactics. The area is extremely hostile, with a newly built perimeter fence and patrols around the clock.",
"release_date":"Sep 27, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1vhz.jpg"
},
{
"title":"Pumpkin Curse",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"Destroy monsters, buy new heads and have fun!",
"release_date":"2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1vhz.jpg"
},
{
"title":"NBA Street Showdown",
"platforms":[
"PlayStation Portable",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"Rule the streets in this big-time baller game, based on the console arcade-style NBA game. Take on the biggest stars of the NBA in full Street style, battle it out with a 3-on-3 game, or go on the ultimate quest to become a Street legend in the King of the Court mode. Create your own Baller and add your personal style. Two unique PSP modes feature unique gameplay for the portable -- earn style points in Shot Blocker and Arcade Shootout modes and enhance your status as the game’s newest street legend. Wireless head-to-head play allows you to go one-on-one against a friend in the original Pick Up game mode, while Party Play lets up to four players can compete in two high-flyin’ game modes, Shot Blocker and Arcade Shootout, using one PSP.",
"release_date":"May 25, 2005",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2eko.jpg"
},
{
"title":"Houkagou Colorful Step: Bunka-bu!",
"platforms":[
"PlayStation Portable",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"Houkagou Colorful Step: Bunka-bu! is an otome game, developed and published by honeybee+, which was released in Japan in 2014.",
"release_date":"Apr 10, 2014",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4s83.jpg"
},
{
"title":"TheTruth.exe",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"This is more than just a game.",
"release_date":"Jun 30, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4s83.jpg"
},
{
"title":"Ghostbusters VR",
"platforms":[
"Meta Quest 2",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"Strap on your proton pack and Quest 2 and step into the world of Ghostbusters in immersive virtual reality. Start your Ghostbusters HQ in a new city, San Francisco, and solve a deep mystery across a new chapter in the Ghostbusters universe.",
"release_date":"TBD",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4oh2.jpg"
},
{
"title":"Simple 2500 Series Portable Vol. 9: The My Taxi!",
"platforms":[
"PlayStation Portable",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"The My Taxi! is a Racing game, developed by Tamsoft and published by D3Publisher, which was released in Japan in 2007.",
"release_date":"Feb 22, 2007",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4tif.jpg"
},
{
"title":"Apple Jack",
"platforms":[
"Xbox 360",
"PC (Microsoft Windows)",
"Mac",
"PlayStation 4",
"Xbox One",
"SG-1000"],
"game_description":"Apple Jack is an Xbox Live Indie game developed by British independent developer Tim Sycamore under the name My Owl Software. The game was published in May 2010. It is a 2D puzzle/platform game.  The game's plot revolves around Apple Jack rescuing his dogs from kidnappers.",
"release_date":"May 01, 2010",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co23fs.jpg"
},
{
"title":"Zoids: The Battle Begins",
"platforms":[
"Commodore C64/128/MAX",
"Amstrad CPC",
"ZX Spectrum",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"Zoids: The Battle Begins is a 1986 battle simulation developed and released in Europe for the ZX Spectrum, Amstrad CPC, MSX and C64 personal computers by Martech, licensed by the Zoids toy manufacturer Tomy.",
"release_date":"1986",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/czeffziu1aqddlum9d5l.jpg"
},
{
"title":"Echo Tokyo: Phoenix",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"Live inside a cyber punk city. Where there is no law. Choose your own way to survive in this visual novel following the exploits of Shizume Misaki looking to survive by any means possible.",
"release_date":"Q2 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2hyb.jpg"
},
{
"title":"why is this dragon so fucking cute??",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"you're tasked to hunt a dragon... but she is so cute?!game features about 4000 words, so it can be comfortably played in one sitting!four different endings including the one true end with cute trans lesbians!!",
"release_date":"Dec 10, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co2hyb.jpg"
},
{
"title":"War Planet Online",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"Build your army, dominate your region and lead your alliance to conquer the globe!",
"release_date":"Nov 30, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co273x.jpg"
},
{
"title":"South Park: The Fractured But Whole - Bring the Crunch",
"platforms":[
"PC (Microsoft Windows)",
"PlayStation 4",
"Xbox One",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"An idyllic summer at Lake Tardicaca turns into a nightmare when the camp counselors go missing. Team up with FastPass, Dr. Timothy, Professor Chaos, and a new member, Mintberry Crunch to save summer camp. Embrace the new “Final Girl” class and overcome the odds to survive.",
"release_date":"Jul 31, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1vxl.jpg"
},
{
"title":"A Perfect Day",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Xbox One",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"‘A Perfect Day’ let you look back on the 90’s of Mainland China, and as a 12 years old child, to experience an unexpected growing by a AVG game way.",
"release_date":"Feb 22, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1xm2.jpg"
},
{
"title":"REPLIKATOR",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Xbox One",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"In this twin-stick roguelite shooter. You play as one of the galactic mercenaries, exploring a mysterious scientific complex and uncover the secret of the REPLIKATOR project. In the role of one of the mercenaries, you will have to fight against hordes of crazed robots and ectoplasmic monsters, while your boss calmly drinks beer in a safe compartment nearby.",
"release_date":"Aug 12, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co31ez.jpg"
},
{
"title":"Resident Evil Revelations Collection",
"platforms":[
"Nintendo Switch",
"Mac",
"Xbox One",
"MSX",
"Xbox One",
"SG-1000"],
"game_description":"A bundle containing Resident Evil Revelations on a game card and download codes for the Resident Evil Revelations 2 episodes. Includes all previously released DLC for the games.",
"release_date":"Nov 30, 2017",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co1wyt.jpg"
},
{
"title":"Advanced Pinball Simulator",
"platforms":[
"Commodore C64/128/MAX",
"Amstrad CPC",
"ZX Spectrum",
"Atari 8-bit",
"Xbox One",
"SG-1000"],
"game_description":"A fast, furious and incredibly addictive pinball game featuring – Trapdoors, Rollover Lanes, Mega-Bumpers, 4 flippers, Bonus Lanes, extra balls, Ball Trap, Mystery Tube, realistic movement and MUCH MORE!!!!",
"release_date":"1998",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/q7pb7v5j5ta5lq2cweyv.jpg"
},
{
"title":"Solarpunkification",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Xbox One",
"SG-1000"],
"game_description":"A guerilla gardener in a crumbling cyberpunk city plants gardens in abandoned buildings to solarpunkify her world.",
"release_date":"May 15, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/q7pb7v5j5ta5lq2cweyv.jpg"
},
{
"title":"Big Bang Show",
"platforms":[
"Philips CD-i",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Xbox One",
"SG-1000"],
"game_description":"Big Bang Show is an exciting and challenging game of skills featuring Albertus the mad scientist and his latest discovery, Sparkie, a bouncing ball of energy.  Only when the player collects the right items, avoids the traps and answers Albertus' questions, can he hyper-space jump into another period. This requires reflexes, speed, knowledge and memory.  More than just a game, the host Albertus adds warmth, humour and personality, presenting realistic adventure for the participants to experience.  Big Bang Show offers a rich graphic environment, including computer graphics for all game screens, digitalized images to illustrate the five periods, video sequences for Albertus' appearances, a sound element for the sound of the ball in movement or in collision with objects, and an original musical accompaniments to the game.",
"release_date":"Feb 01, 1992",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/d6krkjdzk3wn1y19qzcp.jpg"
},
{
"title":"Light 'em Up",
"platforms":[
"Web browser",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Xbox One",
"SG-1000"],
"game_description":"Light the path from the source tile to the destination tiles.",
"release_date":"Dec 08, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co4usd.jpg"
},
{
"title":"Jewel Match Atlantis Solitaire 2 Collector's Edition",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Xbox One",
"SG-1000"],
"game_description":"Return to the amazing undersea world of Atlantis Solitaire for a new adventure! Embark on a journey across 600 (!) oceanic levels and restore 10 magnificent seascapes. Unravel 24 solitaire variants and enjoy the all-new supersize and challenge levels.",
"release_date":"Mar 16, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co46h1.jpg"
},
{
"title":"Chain of Command",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Xbox One",
"SG-1000"],
"game_description":"Chain of Command was created by 2AM Games in 1999",
"release_date":"Jan 13, 2000",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/jqtjd33nuv4evlguc4d4.jpg"
},
{
"title":"War and Order",
"platforms":[
"iOS",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Xbox One",
"SG-1000"],
"game_description":"A MMORPG for Mobile and Tablet users.",
"release_date":"Apr 06, 2016",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/znlm356k9dc2ajz0bafq.jpg"
},
{
"title":"Motorbike",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"A casual bike skills game full of action and real physics dynamics. Motorbike comes with 100 original tracks, thousands of online tracks and a track editor to create your own tracks and share with other players. Additionally, you can play Motorbike online against other players. Select from different riders, bikes and landscapes. You will find Motorbike easy to play but hard to master.",
"release_date":"Jan 19, 2015",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/l7rgik5ey5q83kok8fhj.jpg"
},
{
"title":"Combat Mission 2",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"Battlefront.com's latest entry in the Combat Mission modern warfare simulator depicts a 2017 conflict between NATO and Russia.",
"release_date":"Oct 29, 2002",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/qhlfx16widrgcdpfqmdb.jpg"
},
{
"title":"Jan Jan Paradise 2",
"platforms":[
"Arcade",
"Mac",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"A sequel of Jan Jan Paradise with additional anime characters to play against.",
"release_date":"Feb 01, 1997",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/qoawixb0yhfg91jm8fn8.jpg"
},
{
"title":"Drug Wars",
"platforms":[
"Philips CD-i",
"Mac",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"CD-i FMV lightgun shooter where the player faces off against international drug runners throughout South America. The sequel to Crime Patrol. Uses the CD-i Peacemaker Gun.",
"release_date":"1996",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co5acl.jpg"
},
{
"title":"Goroons",
"platforms":[
"PC (Microsoft Windows)",
"Xbox One",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"Morph. Act. Together. Save your planet! 'These lovable creatures need to work together and stop the destruction of their planet!'",
"release_date":"Aug 06, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co41ef.jpg"
},
{
"title":"FightNJokes",
"platforms":[
"Xbox One",
"Nintendo Switch",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"FightNJokes is a semi-humorous retro style 2D fighting game created from original IP while taking a gentle poke at the more serious sides of Fighting Games. Don't be confused, FightNJokes may not take itself too seriously, there is a real solid, fun combat and fighting experience here. FightNJokes is designed in a unique hand-drawn retro style palette simulating 256 colors, with old school style pixel graphics and effects with fast fluid 60 frames per seconds animations.",
"release_date":"Jan 03, 2022",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co57ng.jpg"
},
{
"title":"Subnodule",
"platforms":[
"Mac",
"Nintendo Switch",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"You control a submarine in hostile waters. Sharing the deep sea with you are several dangerous creatures such as jellyfish, eels, sharks and the mysterious X-Sub. Destroy everything to reach the next level. This game has intermissions as well.",
"release_date":"Feb 01, 1987",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/oyqfscfgey2oznclyfpq.jpg"
},
{
"title":"Sledge 3D",
"platforms":[
"Vectrex",
"Nintendo Switch",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"A demo program for the 3-D Goggles. BaronVR described it like this : 'The effect is that of a track extending from the monitor surface to about 3 feet inside the monitor surface, the speed controlled by pushing up or down on the joystick...'",
"release_date":"Feb 01, 1983",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3zft.jpg"
},
{
"title":"Phantom Typist",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"PlayStation 3",
"Mac",
"Android",
"iOS"],
"game_description":"Phantom typist is the typing arcade game which you can learn and improve typing skill of Chinese characters. Type correct Chinese characters to clear the falling blocks before they fill up the screen, get the high score at the leaderboard with various play modes and levels!",
"release_date":"Jul 14, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3vad.jpg"
},
{
"title":"Trains Girl Locomotion",
"platforms":[
"Linux",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Android",
"iOS"],
"game_description":"Build train infrastructure to connect towns so girlfriends can visit for hangouts and parties.",
"release_date":"Feb 14, 2019",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co3vad.jpg"
},
{
"title":"Crazy Flasher 7: Mercenary Empire",
"platforms":[
"PC (Microsoft Windows)",
"PC (Microsoft Windows)",
"Mac",
"Web browser",
"Android",
"iOS"],
"game_description":"The end is coming, the zombies are rampant, the horizontal battle is refreshing, fighting, cold weapons, firearms, skills, mercenaries...retro graphics, classic old games from 2011 made by AndyLaw!",
"release_date":"Jan 19, 2021",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co45po.jpg"
},
{
"title":"Hyper Train Corporation",
"platforms":[
"PC (Microsoft Windows)",
"Mac",
"Mac",
"Web browser",
"Android",
"iOS"],
"game_description":"Try what it feels like to be one of the top managers of the corporation engaged in construction of the vacuum tube train network. Enhance roads and trains, set the rates and deal with accidents. Design high-speed rail transportation and connect the world’s megacities!",
"release_date":"Jun 18, 2018",
"cover":"//images.igdb.com/igdb/image/upload/t_thumb/co45po.jpg"}
]